{"data":{"allMarkdownRemark":{"edges":[{"node":{"excerpt":"<p>اگر تا بحال سرو کارتون با redux یا هر state management دیگه‌ای افتاده باشه. حتما از normal کردن دیتا چیزی به گوش‌تون خورده. به طور کلی normal بودن یک data به این معنی هستش که میزان تو رفتگی داده‌ها انقدر نباشه که کار ما رو برای بروزرسانی، حذف و تغییر و حتی دسترسی به اون داد‌ه‌ها دچار مشکل کنه. البته که پکیج‌هایی هستند که این امکان رو به ما میدن که بتونیم دیتا بدیم و از طرفی normal شده تحویل بگیریم. اما اینجا من قصد دارم از با استفاده از متد <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/Reduce\">Reduce</a> برای normal کردن دیتا استفاده کنم.</p>\n","frontmatter":{"title":"normal کردن Data با استفاده از متد Reduce","path":"/normalize-data-by-reduce","date":null}}},{"node":{"excerpt":"<p>این نوشته خلاصه‌ای است از کتاب <a href=\"https://github.com/getify/You-Dont-Know-JS/blob/master/scope%20&#x26;%20closures/README.md#you-dont-know-js-scope--closures\">You Don't Know JS Scope &#x26; Closures</a> که میتونه به شما در درک بهتر جاوااسکریپت کمک کنه. البته که من خوندن خود کتاب رو به شما پیشنهاد می‌کنم اما مطالعه این خلاصه هم خالی از لطف نیست امیدوارم مفید باشه.</p>\n","frontmatter":{"title":"خلاصه‌ای از کتاب You Don't Know JS Scope & Closures","path":"/summarize-ydj-scope-closure","date":null}}},{"node":{"excerpt":"<p>مدتی پیش قصد داشتم از <a href=\"https://github.com/paypal/downshift\">down shift</a> استفاده کنم که شکل رندر کردنش توجهم رو جلب کرد. به شکل جذابی میومد از متد‌هایی که داخل کامپوننت والد تعریف شده بود استفاده می‌کرد و اون رو به childrenهاش می‌رسوند. این شد که رفتم دنبالش ببینم چطور همچین چیزی رو نوشته و بعد از پیدا کردن جوابم (با استفاده از خوندن کد‌های این <a href=\"https://github.com/kentcdodds/react-toggled\">پکیج</a>) تصمیم گرفتم چیزی که یاد گرفتم رو به اشتراک بگذارم.<br /></p>\n","frontmatter":{"title":"اندر مزایای استفاده از تابع به عنوان children در React","path":"/react-method-as-arguments-for-children","date":"2018-02-02"}}},{"node":{"excerpt":"<p>وانیلا؛ نه فِریم وورکه نه یک کتابخونه تازه و نه چیزی شبیه به این. وانیلا یک جور ایده است با این هدف که توسعه دهنده‌هایِ جاوا‌اسکریپت، ترغیب بشن تا به صورت ساده و بی هیچ ابزاری برنامه‌نویسی کنن. البته نه به این جهت که ابزار‌ها بد هستن، به این خاطر که اکثر اونها دائم تغییر میکنن و حتی منسوخ میشن! و طبیعی هست که ما برای بقا، به دانشی بیشتر از دونستن راه تعامل با اون ابزار‌ها احتیاج داریم. بیشتر از این در مورد وانیلا توضیح نمیدم اگر به دنبال اطلاعات بیشتری هستید به <a href=\"https://snipcart.com/blog/learn-vanilla-javascript-before-using-js-frameworks\">اینجا</a> مراجعه کنید.</p>\n","frontmatter":{"title":"ساخت یک اسلاید‌‌شو ساده با وانیلا جاوا‌اسکریپت","path":"/make-a-slideshow-by-vanilla-javascript","date":"2017-03-23"}}}]}},"pageContext":{}}